//--------ЗАНЯТИЕ ОТ 09.02.2023---------
# include <iostream> // Библиотека ввода вывода (cout, cin)

using namespace std; // Оператор области видимости

int main() // Главная функция
{
	// const int k = 1;

	// int i; // 4-байта | целые числа
	// float f; // 4-байта | вещественные числа
	// char c; // 1-байт | символ 's'
	// bool b; // 1-байт | true, false (1 или 0)
	// double d; // 8-байт | очень большое или очень маленькое число, точность''
	// string s; // n-байт | хранит строки

	// i = 100;
	// f = 3.14;
	// c = '%';
	// b = true; //вывод как 1 или 0
	// d = 1.18727727828181;

	// cout << "<: ";
	// cin >> i;

	// cout << i << '\n';
	// cout << f << '\n';
	// cout << c << '\n';
	// cout << b << '\n';
	// cout << d << '\n';

	// string s;
	// s = "Bloody Mary";
	// for (3)
	// {
	//     cout << s << '\n';
	// }

	// int l; // объявление переменной - выделение для нее памяти
	// int l = 1; // инициализация переменной, лучше - передача переменной значения

	//if (i < 10) // Проверка условия [<,>, ==, !=]
	//{
	//	cout << "True" << endl;
	//}

	//float height = 0;
	//cout << ">: ";
	//cin >> height;
	//cout << height * 3.86;

	int y = 2023;
	int x = 0;
	cout << ">: ";
	cin >> x;
	cout << "Age: " << y - x;
}
